// Задача: Сума чисел
// Напишіть функцію, яка приймає число n і обчислює суму всіх цілих чисел від 1 до n.

function sumOfNumber(n) {
    let totalSum = 0;
    for (let i = 0; i <= n; i++){
        totalSum += i;
    }
    return totalSum;
}

console.log(sumOfNumber(5));

// Задача: Парні числа
// Напишіть функцію, яка приймає число n і виводить всі парні числа від 1 до n.



// Задача: Таблиця множення
// Напишіть функцію, яка створює таблицю множення для заданого числа n. Наприклад, якщо n дорівнює 5, то виведіть таблицю множення для 5x1, 5x2, ..., 5x10.

// Задача: Пошук найменшого елемента
// Напишіть функцію, яка приймає масив чисел і знаходить найменший елемент в цьому масиві.

// Задача: Перевірка на простоту
// Напишіть функцію, яка приймає число і перевіряє, чи воно є простим.